export const lastQuestion = 'Ок, я все знаю! Впустіть мене на курс!';
export const letMeOut = 'Пустіть! Мене! На курс!';

export const botReplies = {
  successCaptcha:
    'Чудово! Будемо вважати, що перевірку пройдено. Прослухаю її пізніше. Тебе, напевно, мучить головне питання?',
    repeatCaptchaRequest:
    'Чудово! Але я не зможу тобі довіряти до того як ти відправиш голосове повідомлення. ;)',
  proposeAnswers: 'Я готовий повторити відповіді. Хочеш?',
};

export const welcomeMessage = `
Привіт!

Я Заводний Коттан і я тут, щоб допомогти тобі почати навчання на нашому курсі.

З початку, мені потрібно, щоб ти підтвердив, що ти людина. Такі часи, що поробиш.

Відправ голосовушку зі словами: "Я хочу стати крутим розробником!"
`;

export const lastMessage = `
Ласкаво просимо і хай щастить. :)

https://github.com/kottans/frontend#readme
`;

export const keyboard = {
  how_to_begin: 'Як потрапити на курс?',
  how_long: 'Як довго триватиме навчання?',
  what_is_stages: 'Що за стадії?',
  how_to_stage_one: 'І як перейти зі Stage 0 на Stage 1?',
  salary: 'Коли в мене буде зарплата 6000 доларів?',
};

export const faq = {
  [keyboard.how_to_begin]:
    'Дуже легко! Просто починаєш виконувати завдання і все. Тобі не потрібно подавати заявки, проходити вступні тести або робити щось подібне.',
  [keyboard.how_long]:
    'Курс складається з двох частин - Stage0 та Stage1. Stage0 починається 1го серпня та триває 2 місяці. Після цього, ми відберемо 30 людей, які перейдуть на наступну стадію.',
  [keyboard.what_is_stages]:
    'Stage0 - це самостійне навчання, яке дасть тобі базові знання для проходження Stage1. А Stage1 - це лекції, які проводяться нашими лекторами',
  [keyboard.how_to_stage_one]:
    'Щоб потрапити на Stage1 тобі потрібно виконати усі завдання Stage0 та пройти співбесіду. Співбесіда буде за матеріалами Stage0. І в цілому про життя :) Нічого страшного, хвилюватись не треба.',
  [keyboard.salary]:
    'Розуміємо. Усіх це хвилює. Але ми не гарантуємо працевлаштування. :) Ми тільки займаємось навчанням. Зазвичай наші студенти самостійно влаштовуються на роботу ще до кінця курсу, але все залежить від них самих.',
};
