export const lastQuestion = 'Ок, я все знаю! Впустите на курс!';
export const letMeOut = 'Пустите! Меня! На курс!';

export const welcomeMessage = `
Привет!

Я Заводной Коттан и я тут, чтобы помочь тебе начать обучение на нашем курсе.

Для начала, мне нужно, чтобы ты подтвердил, что ты живой. Времена такие, сам понимаешь.

Отправь голосовушку с текстом: "Я хочу стать крутым разработчиком!"`;

export const lastMessage = `
Добро пожаловать и удачи. :)

https://github.com/kottans/frontend#readme
`;

export const keyboard = {
  how_to_begin: 'Как попасть на курс?',
  how_long: 'Как долго длится обучение?',
  what_is_stages: 'Что еще за стадии?',
  how_to_stage_one: 'И как перейти со Stage 0 на Stage 1?',
  salary: 'Когда у меня будет зарплата 6000 долларов?',
};

export const faq = {
  [keyboard.how_to_begin]:
    'Очень легко! Просто начинаешь выполнять задания и все. Тебе не надо подавать заявки, проходить вступительные тесты или делать что-то подобное.',
  [keyboard.how_long]:
    'Курс делится на две части - Stage 0 и Stage 1. Stage 0 начинается 1 августа и длится 3 месяца. После этого, мы отберем 30 человек которые перейдут на следующую стадию',
  [keyboard.what_is_stages]:
    'Stage 0 - это самостоятельное обучение, которое даст тебе базовые знания для прохождения аудиторной части. И Stage 1 - это лекции, которые читаются нашими лекторами',
  [keyboard.how_to_stage_one]:
    'Чтобы попасть на Stage 1 тебе нужно выполнить все задания Stage 0 и пройти собеседование. Собеседование будет по материалам Stage 0. Ну и в целом, поговорить за жизнь. :) Ничего страшного, волноваться не надо',
  [keyboard.salary]:
    'Понимаю. Всех это волнует. Но мы не гарантируем трудоустройства. :) Мы только занимаемся обучением. Обычно наши студенты сами устраиваются на работу еще до конца курса, но все зависит от них.',
};
